<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"dev","backend":"ba0af6014c61eee5355091cad879fe616eebd3352e5278af97ae65b8ba46237e","plan_job_ref":"Job Pull Request Checks #511 at https://github.com/GSA-TTS/FAC/actions/runs/22910022190","plan_out_hash":"d3bbca9a73a9af0cbb548af0115c92377763710f29773ebf0825e54d2f7e9591","plan_hash":"ff315c77cd700ad6769e8886b256a6c159fc638f8a88b7536e6d28f29290c182","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan for __dev__
<details>
<summary>Plan: 1 to add, 3 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.dev.module.cors.null_resource.cors_header must be replaced
-/+ resource "null_resource" "cors_header" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "always_run" = "2026-03-09T20:12:44Z" -> (known after apply)
        }
    }

  # module.dev.module.metabase-app[0].cloudfoundry_app.metabase will be updated in-place
!~  resource "cloudfoundry_app" "metabase" {
+       buildpacks                  = (known after apply)
!~      created_at                  = "2026-03-06T18:05:06Z" -> (known after apply)
!~      docker_image                = "metabase/metabase@sha256:f8ad50bba07c555e103097218e9a8b4edbd64311e754072d148578cd54c5bd9a" -> "metabase/metabase@sha256:80fdf179262eb4bc6e620eb2f90e1781b7d4ebb96e9ec45d974ca57675ed5003"
!~      enable_ssh                  = false -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "metabase"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "metabase-dev.app.cloud.gov" -> null
            },
        ] -> (known after apply)
!~      stack                       = null -> (known after apply)
!~      updated_at                  = "2026-03-09T17:06:59Z" -> (known after apply)
#        (11 unchanged attributes hidden)
    }

  # module.dev.module.metabase-app[0].cloudfoundry_route.app_route will be updated in-place
!~  resource "cloudfoundry_route" "app_route" {
!~      destinations = [
-           {
-               app_id           = "c3491381-d837-411d-9344-ba7643f3647a" -> null
-               app_process_type = "web" -> null
-               id               = "e63f47ac-6183-4830-a509-0f37188f31fa" -> null
-               port             = 3000 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "ea798200-c973-4d43-91d1-af044bfdad25"
!~      updated_at   = "2026-03-06T18:05:13Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.dev.module.newrelic.newrelic_nrql_alert_condition.http_500_errors will be updated in-place
!~  resource "newrelic_nrql_alert_condition" "http_500_errors" {
-       description                    = <<-EOT
            
        EOT -> null
        id                             = "4900037:58210045"
        name                           = "HTTP 500 Errors Detected"
#        (18 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #511](https://github.com/GSA-TTS/FAC/actions/runs/22910022190)